<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>PayloadDisplayName</key>
    <string>Cloudflare 1.1.1.1</string>
    <key>PayloadDescription</key>
    <string>Configures Cloudflare's secure DNS resolver on this device.</string>
    <key>PayloadIdentifier</key>
    <string>com.apple.profile.570b09b7-df89-46f6-a60d-34a56ddcbf76</string>
    <key>PayloadScope</key>
    <string>System</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>570b09b7-df89-46f6-a60d-34a56ddcbf76</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadContent</key>
    <array>
      <!-- Cloudflare 1.1.1.1 (DoH) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>Cloudflare 1.1.1.1 (DoH)</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.4165cd28-058b-4265-b587-e38d927e7867</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>4165cd28-058b-4265-b587-e38d927e7867</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>HTTPS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2606:4700:4700::1111</string>
            <string>2606:4700:4700::1001</string>
            <string>1.1.1.1</string>
            <string>1.0.0.1</string>
          </array>
          <key>ServerURL</key>
          <string>https://cloudflare-dns.com/dns-query</string>
        </dict>
      </dict>
      <!-- Cloudflare 1.1.1.1 (DoT) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>Cloudflare 1.1.1.1 (DoT)</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.1c9eaee6-dfd7-4fc2-8d58-718641594fcb</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>1c9eaee6-dfd7-4fc2-8d58-718641594fcb</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>TLS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2606:4700:4700::1111</string>
            <string>2606:4700:4700::1001</string>
            <string>1.1.1.1</string>
            <string>1.0.0.1</string>
          </array>
          <key>ServerName</key>
          <string>1dot1dot1dot1.cloudflare-dns.com</string>
        </dict>
      </dict>
      <!-- Cloudflare 1.1.1.1 Security (DoH) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>Cloudflare 1.1.1.1 Security (DoH)</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.a20ea798-e337-400e-9e53-b004389f9c5a</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>a20ea798-e337-400e-9e53-b004389f9c5a</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>HTTPS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2606:4700:4700::1112</string>
            <string>2606:4700:4700::1002</string>
            <string>1.1.1.2</string>
            <string>1.0.0.2</string>
          </array>
          <key>ServerURL</key>
          <string>https://security.cloudflare-dns.com/dns-query</string>
        </dict>
      </dict>
      <!-- Cloudflare 1.1.1.1 Security (DoT) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>Cloudflare 1.1.1.1 Security (DoT)</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.7715e8da-3b6a-41e1-8619-3ba2973512f3</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>7715e8da-3b6a-41e1-8619-3ba2973512f3</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>TLS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2606:4700:4700::1112</string>
            <string>2606:4700:4700::1002</string>
            <string>1.1.1.2</string>
            <string>1.0.0.2</string>
          </array>
          <key>ServerName</key>
          <string>security.cloudflare-dns.com</string>
        </dict>
      </dict>
      <!-- Cloudflare 1.1.1.1 Family (DoH) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>Cloudflare 1.1.1.1 Family (DoH)</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.ee04d07e-a23d-4758-8798-bf639508b52f</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>ee04d07e-a23d-4758-8798-bf639508b52f</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>HTTPS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2606:4700:4700::1113</string>
            <string>2606:4700:4700::1003</string>
            <string>1.1.1.3</string>
            <string>1.0.0.3</string>
          </array>
          <key>ServerURL</key>
          <string>https://family.cloudflare-dns.com/dns-query</string>
        </dict>
      </dict>
      <!-- Cloudflare 1.1.1.1 Family (DoT) -->
      <dict>
        <key>PayloadDisplayName</key>
        <string>Cloudflare 1.1.1.1 Family (DoT)</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dns.27537e13-cfa9-4c8c-a8a7-6b1d0d3a92d4</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>27537e13-cfa9-4c8c-a8a7-6b1d0d3a92d4</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>TLS</string>
          <key>ServerAddresses</key>
          <array>
            <string>2606:4700:4700::1113</string>
            <string>2606:4700:4700::1003</string>
            <string>1.1.1.3</string>
            <string>1.0.0.3</string>
          </array>
          <key>ServerName</key>
          <string>family.cloudflare-dns.com</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
